<!DOCTYPE html>
<html lang="en">
<head>
    <link rel="stylesheet" href="UutisienCss.css">
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Kotisivu Ma-technology </title>
</head>
<body>
    
    <h1>Uutiset</h1>

<header>
    <div class="main">
        <ul>
            <li><a href="Index2.html">Uutiset</a></li>
            <li><a href="Index3.html">Tietoa</a></li>
            <li><a href="Index1.html">Kotisivu</a></li>
            <li><a href="Index4.html">Kauppa</a></li>
        </ul>
    </div>
</header>

<br>
<center>
<h1>Microsoft Flight Simulator 2020 Beta pika-arvostelu.</h1>
<h6>Kirjoittanut: Alex Ruuska 6.8.2020. <br> Aihe: Simulaattorit</h6>
</center>
<br>

<center>
<p>Microsoft Flight Simulator 2020 on ehk&auml; vuoden 2020 Videopeli/simulaattori. Peli julkaistaan 18. p&auml;iv&auml; elokuuta, mutta sit&auml; p&auml;&auml;see pelaamaan jo Beetaan. Me p&auml;&auml;simme noin 11 kuukauden odottelun j&auml;lkeen beeta ohjelmaan ja testasimme kyseist&auml; peli&auml; beeta versiolla! Testikokoonpano: Amd ryzen 5 2600, RX 570, 16GB ram sek&auml; k&auml;yt&ouml;ss&auml; oli 3 n&auml;ytt&ouml;&auml; (peli py&ouml;ri vaan yhdell&auml; n&auml;yt&ouml;ll&auml;).</p>

<br>
<h1>Grafiikat</h1>
<br>
<p>Itse peli Grafiikat on aivan uskomattomat! Puut, talot, lentokent&auml;t, 
    pilvet, meret ja l&auml;hes kaikki on todella hienon n&auml;k&ouml;isi&auml;, 
    mutta se n&auml;kyi my&ouml;s peli sulavuudessa :(. RX 570 kanssa pysty jopa 
    k&auml;ytt&auml;m&auml;&auml;n high asetuksia, mutta esimerkiksi kaupungeissa
     pit&auml;&auml; laskea joko medium tai low koska koneen tehot eiv&auml;t jaksa.
      Kuitenkaan testi koneen tehot ei kerro mit&auml;&auml;n pelist&auml; tai siit&auml; 
      kuinka uskomattoman upea t&auml;m&auml; kyseinen peli on. Jotkut Rakennukset on tehty 
      manuaalisesti ja nekin ovat upeita! Oman talon pystyy n&auml;kem&auml;&auml;n, mutta 
      samalta se ei luultavasti tule n&auml;ytt&auml;m&auml;&auml;n. V&auml;rit tai muoto voi 
      olla erilainen, kun oikeasti, mutta k&auml;yt&auml;nn&ouml;ss&auml; siit&auml; ei ole 
      mit&auml;&auml;n haittaa, koska kerran siell&auml; omalla talolla tulee k&auml;yty&auml;.
       Me emme valitettavasti saatu Your ID teksti&auml; pois, joten NDA s&auml;&auml;nt&ouml;jen 
       mukaan emme saa n&auml;ytt&auml;&auml; videota, videokuvaa tai valokuvia. Kuitenkin netiss&auml; 
       on erilaisia kuvia pelist&auml; ja otimme niist&auml; muutaman kuvan t&auml;m&auml; 
       tekstin alapuolelle. &shy;&shy;&shy;&shy;&shy;&shy;&shy;</p>
</center>

<center>
<img src="1.jpg" class="malli1">
</img>

<img src="2.jpg" class="malli2">
</img>
<img src="3.jpg" class="malli3">
</img>
<img src="4.jpg" class="malli4">
</img>
</center>

<br>
<center>
<h1>Lentokoneet ja lentokentät.</h1>
</center>
<br>
<center>
    <p>Microsoft Flight Simulator 2020:sess&auml; on grafiikoiltaan <u>hyv&auml;n oloiset lentokoneet</u>. 
        Ohjaamot hyvi&auml; ja ulkoap&auml;in koneet n&auml;ytt&auml;v&auml;t hyv&auml;lt&auml;.
         Kuitenkin <u>A320neo on pettymys Beeta</u> versiossa, koska noin puolet napeista ei toiminut. 
         Itse koneen MCDU toimi ilman ongelmia ja <u>&auml;&auml;net olivat jokaisessa testi koneessa &auml;&auml;rett&ouml;m&auml;n hyv&auml;t</u>, 
         mik&auml; oli positiivinen yll&auml;tys. Simulaattorin &auml;&auml;net ovat jossain koneissa ihan oikeista koneista. 
         Lentokoneiden <u>lent&auml;minen on huomattavasti vaikeampaa</u>, kun esimerkkisi X-plane 11 (2015-2016) tai FSX = Filght Simulator X (2007). 
         Esimerkiksi lentokoneen <u>lasiin tulee j&auml;&auml;t&auml;, jos on talvi</u> tai jos on sade, 
         niin vesipisarat &rdquo;valuu&rdquo; lasin yli mik&auml; on hieno ominaisuus. My&ouml;s lentokone &rdquo;heiluu&rdquo; s&auml;&auml;n mukaan 
         ja laskeutuminen on paljon hankalampaa, kun koskaan ennen. Lentokent&auml;t on kaikki todella hyvi&auml;. Peliss&auml; on my&ouml;s custom 
         lentokentti&auml; mitk&auml; on tehty todella hyvin. Esimerkiksi Helsinki-Vantaa ei ole custom lentokentt&auml;, mutta graafisesti lentokentt&auml; 
         on tehty hyvin ja yksityiskohtaisesti jos lennonjohtotornin puuttumista ei lasketa. Laitamme alas kuvia lentokentist&auml; ja lis&auml;&auml;
          lentokoneista. Muista, ett&auml; emme ole itse ottanut kuvia NDA:aan takia.</p>
    </center>

<center>
<img src="scenery_malmi_FS2020.jpg" class="malli1">
<img src="5.png" class="malli2">
<img src="6.jpg" class="malli3">
</center>

<br>
<center>
<h1>Korjattavaa ja huomiot.</h1>
<br>
<p>My&ouml;s Beeta versiossa on viel&auml; ongelmia, vaikka peli&auml; on hypetetty ja grafiikoiltaan hyv&auml;. Listasimme t&auml;h&auml;n osioita mit&auml; pit&auml;&auml; parantaa tai niiss&auml; on ongelmia.</p>
<p>-Airbus A320neo:on ohjaimisto on keskener&auml;inen. T&auml;m&auml; voidaan korjata virallisessa versiossa.</p>
<p>- Isoja matkustaja koneita on vaan kaksi halvimmassa versiossa. T&auml;m&auml; voi ratketa Marketplacen tulessa.</p>
<p>-Beetasta ei saa kuvata mit&auml;&auml;n, jos ei ole kuuluisa esim. tubettaja. Ratkeaa virallisessa versiossa.</p>
<p>-Huonolla koneella peli ei py&ouml;ri hyvin. Rx 570 on tarpeeksi hyv&auml; n&auml;yt&ouml;nohjain, mutta ramia kannattaa olla 16gb, 8gb sijaan.</p>
<p>-Kun valitsee lentokentt&auml;&auml;, pilvet tulee eteen, mutta zoomaamalla n&auml;kyy paremmin. Ei ole iso vika.</p>
<p>-Lentokoneen sis&auml;ll&auml; ei minun tiet&auml;&auml;kseni voi liikkua yl&ouml;sp&auml;in tai alas päin tai se on tehty hankalaksi. Voidaan korjata.</p>
<p>Pelist&auml; on kyll&auml; vaikea l&ouml;yt&auml;&auml; mit&auml;&auml;n Korjauttamaan tai antamaan huomioita, kun peli on tehty niin hyvin.</p>
</center>

<br>

<h1 style="text-align: center;">Tiivistelm&auml;.</h1>

<br>
<p style="text-align: center;">Microsoft Flight Simulator beta on grafiikoiltaan todella hyv&auml; simulaattori, mutta tietenkin vaatii paljon tehoa koneelta.</p>
<p style="text-align: center;">A320neo oli testin aikana ainut kone mihin ei ole n&auml;ht&auml;v&auml;sti panostettu, kun puolet napeista ei toimi. T&auml;m&auml; voidaan korjata. Muuten koneet ovat todenmukaisia ja niit&auml; my&ouml;s on hankalampi lent&auml;&auml;.</p>
<p style="text-align: center;">Peliss&auml; on kyll&auml; ongelmia. Ne voit katsoa Korjattavaa ja huomiot kohdasta!</p>
<p style="text-align: center;">Hinta (69&euro; standardi versio) on houkutteleva hinta ja ehdottomasti kokeneelle hintansa arvoinen. Ehk&auml; aloittelijalle peli voi olla liian hankala. Esim. Steamin alesta voi saada 10&euro; FSX mik&auml; on aloittelijalle hyv&auml;.</p>

<h6 style="text-align: center;">Kirjoittanut ja testannut: Alex Ruuska 3-5.8.2020 p&auml;ivitetty: -</h1>


<center>
<h6>
(c) copyright MA-Technology
</h6>
</center>

</html>